_org_posts/2016-11-12-lambda-calculus,-a-suprisingly-powerful-language.tex
% Created 2016-11-12 Sat 17:38
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{2016-11-12}
\title{Lambda calculus, a suprisingly powerful language}
\hypersetup{
 pdfauthor={},
 pdftitle={Lambda calculus, a suprisingly powerful language},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.4.1 (Org mode 8.3.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

I'm reading the book \href{https://www.cis.upenn.edu/~bcpierce/tapl}{Types and Programming Languages} from Benjamin C.
Pierce from time to time at the moment. The chapter explaining the
\textbf{untyped lambda calculus} gave me more than one occasion to pause and
think. The lambda calculus, invented in the 30s, is a formal system
for expressing computation with functions and can also been seen as a
programming language. A very simple one, yet a surprisingly very
powerful one. A language where all computations are done with
functions, thus the first functional programming language in the
history of mankind. It plays an important role in the field of
research but also as a theoretical foundation for implementing
functional languages such as Haskell, OCaml, Scheme, Clojure etc.

The lambda calculus is composed of three elements (or in programming
language theory jargon, of three \emph{terms}):

\begin{itemize}
\item variables, of the form \texttt{x}
\item abstractions, of the form \texttt{λx.t}
\item applications, of the form \texttt{t s}
\end{itemize}

Abstraction can almost be seen like a function in "classic"
programming languages. Application "applies" its arguments to an
abstraction. There is nothing more. There are no booleans, numbers,
strings, if statements etc. Function accepts only one argument. Yet,
everything can be computed with it.

A variable \texttt{x} is \emph{bound} if it occurs in the abstraction of the body
\texttt{t} of an abstraction \texttt{λx.t}. It is is \emph{free} if it appears if it is
not bound by an enclosing abstraction on \texttt{x}. For example in \texttt{(λx.x)
x} the first \texttt{x} is bound, the second one is free. A term with no free
variables is called a \emph{combinator}. \footnote{I'm paraphrasing the book here and also a lot below!}

The simplest combinator is the identity function. It returns its
argument unchanged:

\texttt{id = λx. x}

There are different strategies when choosing on how arguments are
evaluated before applying them to functions. That is, there are
different strategies to \emph{reduce} the terms. The most common one is
\emph{call-by-value}. Under this strategy a function can be applied only
when its right-hand side has been reduce to a \emph{value}. A value is a
term that cannot be further reduced.

Thus \texttt{(λx.x x) (λx.x) y} reduces to \texttt{(λx.x) (λx.x) y} in the first
evaluation step then to \texttt{(λx.x) y} then to \texttt{y}. Functions with
multiple arguments can be simulated by having a function returning
another function: \texttt{λx.λy.x y}. This is familiar to functional
programmers as \emph{currying}.

What really impress me is that every computation are possible with
such a simple language. I will give a few examples from the book, some
are answers from exercises, so I you indent to read it I would suggest
to stop your reading here.

Boolean values can be \emph{encoded} as functions like this:

\texttt{tru = λt. λf. t}

\texttt{fls = λt. λf. f}

\emph{Tru} is a function that discards the value of its second argument
and returns the value of its first argument. \emph{Fls} is a function that
discards the value of its first arguments and returns the value of
its second argument. They are used as a representation of the True
and False booleans.

The \emph{test} combinator can be defined like this:

\texttt{test = λl. λm. λn. l m n}

If the first argument of \emph{test} is \texttt{tru} the expression will reduce to
\texttt{m}, if it is false it will reduce to \texttt{fls}. For example \texttt{test tru x
y} evaluates to \texttt{tru x y} which evaluates to \texttt{x}. Awesome, it is
almost like a \emph{if} statement.

Numbers can be encoded too. The \emph{Church numerals} \footnote{\href{https://en.wikipedia.org/wiki/Alonzo_Church}{Alonzo Church} invended the lambda calculus.} are defined like
this:

\texttt{c0 = λs. λz. z}

\texttt{c1 = λs. λz. s z}

\texttt{c2 = λs. λz. s (s z)}

and so on and so on. Function such as \texttt{successor} and
\texttt{plus} can also be defined.

Data structures such as pairs can also be encoded: 

\texttt{pair = λf. λs. λb. b f s}

\texttt{fst = λp. p tru}

\texttt{snd = λp. p fls}

Take a paper and a pen and evaluate \texttt{fst (pair v w)}. It evaluates to
\texttt{v}, as expected.

Lists can also be encoded. The list \texttt{[x, y, z]} can be encoded as the
abstraction \texttt{λc. λn. λb. c x (c y (c z n))}. That is a \emph{fold} (or
\emph{reduce}) is used to encode the list.

The usual functions to manipulate lists can be defined:

\texttt{nil = λc. λn. n}

\texttt{isnil = λl. l (λh. λt. fls) tru}

\texttt{cons = λh. λt. λc. λn. c h (t c n)}

\texttt{head = λl. l (λh.λt.h) fls.}

\texttt{tail = λl. fst (l (λx. λp. pair (snd p) (cons x (snd p))) (pair nil nil))}

It is also possible to encode lists with pairs. It is also possible to
define a mechanism similar to recursion by having functions reducing
their arguments to a form similar to the function itself. For example
this combinator

\texttt{(λx. x x) (λx. x x)} reduces to himself. 

More advanced tricks allow to define the equivalent of recursive
function such as the canonical definition of factorial.

Lambda calculus is a very simple but amazingly powerful language. It
is also striking to make the comparison with some programming
languages such as Java that could not even pass simply a function
around before the most recent versions. 
\end{document}
